// МОДУЛЬ 1. Управління каталогом (Catalog Service)

// Формування та збереження структури страв/товарів із атрибутами: ID, назва, категорія, ціна, доступність, рейтинг.

var product = [
    { id: "001", name: "Лимонад класичний", category: "Напої", price: "65", accessibility: "Немає", rating: "4.5"},
    { id: "002", name: "Еспресо", category: "Напої", price: "45", accessibility: "В наявності", rating: " 4.8"},
    { id: "003", name: "Піца Маргарита", category: "Основні страви", price: "180", accessibility: "В наявності", rating: "4.9"},
    { id: "004", name: "Бургер з яловичиною", category: "Основні страви", price: "220", accessibility: "В наявності", rating: "4.7"},
    { id: "005", name: "Паста Карбонара", category: "Основні страви", price: "195", accessibility: "Немає", rating: " 4.6"},
    { id: "006", name: "Салат Цезар", category: "Закуски", price: "160", accessibility: "В наявності", rating: "4.8"},
    { id: "007", name: "Картопля фрі", category: "Закуски", price: "75", accessibility: "В наявності", rating: "4.3"}
]

// Реалізація чистих функцій фільтрації меню за категорією, діапазоном ціни та статусом наявності.

// Пошук товарів за частковим збігом у назві (без урахування регістру).

// Сортування каталогу за ціною та рейтингом.